app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-08-06 19:17:03.603358"], ["updated_at", "2018-08-06 19:17:03.603358"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["cart_id", 3], ["created_at", "2018-08-06 20:37:27.145171"], ["updated_at", "2018-08-06 20:37:27.145171"], ["price", 750.0]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2018-08-06 20:25:11.709652"], ["id", 1]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)
    session[:counter] = 0

    respond_to do |format|
      if @line_item.save

UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 15], ["updated_at", "2018-08-09 16:44:27.184162"], ["id", 6]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 10]]
---
  def destroy
    if @line_item.quantity > 1
      @line_item.quantity -= 1
      @line_item.save!
    else
      @line_item.destroy