app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" INNER JOIN "line_items" ON "orders"."id" = "line_items"."order_id" WHERE "line_items"."product_id" = ? ORDER BY "orders"."updated_at" DESC LIMIT ?  [["product_id", 1], ["LIMIT", 1]]
---
  def who_bought
    @product = Product.find(params[:id])
    @latest_order = @product.orders.order(:updated_at).last

UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 850.0], ["updated_at", "2018-08-08 18:43:31.266461"], ["id", 1]]
SELECT "products".* FROM "products"
---
  def update
    respond_to do |format|
      if @product.update(product_params)
        format.html { redirect_to @product, notice: 'Product was successfully updated.' }
        format.json { render :show, status: :ok, location: @product }

        @products = Product.all