app/controllers/concerns/current_cart.rb

        def set_cart
            @cart = Cart.find(session[:cart_id])
        rescue ActiveRecord::RecordNotFound
            @cart = Cart.create
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-08-06 19:17:03.603358"], ["updated_at", "2018-08-06 19:17:03.603358"]]